#1 راح نسوي قائمه كل الاسامي 
#2 نفصل كل اسم كامل عن غيره من الاسماء 
#3 نسوي لووب عشان ناخذ كل اسم كامل نفصله حق جزئين ونحطهم بقائمه تحت بعض 
#4 نسوي اكسس او مثلا لست حق الاجزاء الي فصلتهم كل جزء بروحه الاسم الاول بروح ولاسم الاخير بروحع عشان نقدر نسوي اكسس على حروفهم الاولى
#5 نسوي اكسس على اول حرف من الاسم الاول والاسم الاخير
#6 نحط نقطة بين كل حرفين و نضيفهم على القائمه الفاضيه قائمه الاسامي المختصره
#7 نسوي لووب عشان نطبع فيه كل اسم بسطر بروح من قائمة الاسامي المختصره 

#سبلت الاولى عشان نفصل كل اسم كامل عن اسم كامل ثاني 1,2
names = input("enter your friend first name and last name separated by a comma :  ").split(",")
abbreviated_names = []

for name in names :
  #سبلت الثانية راح تاخذ كل اسم و تفصله حق جزئين وتحطهم بقائمه بروح تحت بعض3 
  name_parts = name.split()
  print(name_parts)
  #راح يسويلي اكسس على الاسم الاول و اسم العايلة في القائمه4
  first_name = name_parts[0]
  last_name = name_parts[1]

 #نسوي اكسس على الحرف الاول من الاسم الاول والاسم الاخير5
  first_initial = first_name[0]
  last_initial = last_name[0]
#6 نحط نقطة بين كل حرفين و نضيفهم على القائمه الفاضيه قائمه الاسامي المختصره
  abbreviation = first_initial + "." + last_initial + "." 
  abbreviated_names.append(abbreviation)
#7 نسوي لووب عشان نطبع فيه كل اسم بسطر بروح من قائمة الاسامي المختصره 
print("abbreviated names : ")
for x in abbreviated_names : 
  print(x)




  


  


